const ja: Record<string, Record<string, string>> = {
	header: {
		title: "福岡生徒会連盟",
		home: "ホーム",
		about: "私たちについて",
		executives: "幹部紹介",
		organization: "組織図",
		news: "お知らせ",
		contact: "お問い合わせ",
	},
	footer: {
		instagram: "Instagram",
		connect: "私たちとつながる",
		copyright: "© {year} 福岡生徒会連盟 MITライセンスの下に公開",
		privacy: "プライバシーポリシー",
		terms: "利用規約",
		contact: "お問い合わせ",
	},
	welcome: {
		logoAlt: "福岡生徒会連盟のロゴ",
		title: "人と人、生徒会と生徒会を福岡全土へ",
		learnAboutUs: "私たちについて",
		contactUs: "お問い合わせ",
	},
	organization: {
		title: "組織図",
		alt: "役割分担 (組織図) 代表は田中十和、サポートは阿部亮太、針尾勇輝と岡本陽多。副代表は井上葉月と南里百恵。その下に「総務 田中十和 (メンバー 井上葉月と南里百恵)」、「デザイン 吉田美羽 (メンバー 針尾勇輝と古賀愛佳)」、「広報 岡本陽多 (メンバー 髙浪実里と野本海晴)」、「企画 栗山佑己 (メンバー 平塚裕樹と大石祥太郎)」、「人事 川島朱莉 (メンバー 里村美羽)」が横並びになっている。",
	},
	executives: {
		title: "幹部紹介",
		grade: "年",
	},
	about: {
		title: "私たちについて",
		sloganTitle: "スローガン",
		slogan: "『人と人、生徒会と生徒会を福岡全土へ』",
		purposeTitle: "目的",
		purpose:
			"私たちは、『人と人、生徒会と生徒会を福岡全土へ』をスローガンに掲げ、先生方の手助け等をいただきながら、今後、未来へ繋ぐことの出来る生徒会のコミュニティを作り、福岡県の全生徒会が一丸となって、学校を盛り上げていくことを目的に活動をしています。\n私たちは、この目的を達成するために、福岡生徒会連盟というイベントや企画を行っています。福岡生徒会連盟では、各校の生徒会の方々を招待し、『学校間の壁を超え』それぞれの学校の良い点や課題となる点を話し合い、普段とは違った視点で自分たちの学校を見つめ直す機会を設けています。",
		logoAlt: "福岡生徒会連盟のロゴ",
	},
	supportingOrg: {
		title: "支援団体",
		name: "特定非営利活動法人 生徒会活動振興会",
		description:
			"2023年4月8日設立、2024年11月27日NPO法人化。\n生徒会OB、OGと現役の生徒会役員が全国から集まり、生徒会を通じた人材育成を目的として主にオンラインで活動中。\n学校へのアドバイザー派遣のほか、生徒会役員ネットワークの設立・運営支援や生徒会役員向けの研修、先進的な活動事例の取材、記事、記事執筆等を実施。\n日本最大級の複合的生徒会支援団体。\n福岡生徒会連盟の設立・運営支援を行っています。",
	},
	news: {
		title: "お知らせ",
		noArticles: "まだお知らせがありません。",
	},
}

export default ja
